{
  "books": [
    {
      "isbn": "",
      "title": "1776",
      "subtitle": "",
      "author": "David McCullough",
      "published": "2005-05-24T00:00:00.000Z",
      "publisher": "Simon & Schuster",
      "pages": 386,
      "description": "America's beloved and distinguished historian presents, in a book of breathtaking excitement, drama, and narrative force, the stirring story of the year of our nation's birth, 1776, interweaving, on both sides of the Atlantic, the actions and decisions that led Great Britain to undertake a war against her rebellious colonial subjects and that placed America's survival in the hands of George Washington.",
      "image": "Covers/1776.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "1812",
      "subtitle": "- The War That Forged A Nation",
      "author": "Walter Borneman",
      "published": "2005-10-04T00:00:00.000Z",
      "publisher": "Harper Perennial",
      "pages": 392,
      "description": "Although frequently overlooked between the American Revolution and the Civil War, the War of 1812 tested a rising generation of American leaders; unified the United States with a renewed sense of national purpose; and set the stage for westward expansion from Mackinac Island to the Gulf of Mexico. USS Constitution, 'Old Ironsides,' proved the mettle of the fledgling American navy; Oliver Hazard Perry hoisted a flag boasting, 'Don't Give Up the Ship'; and Andrew Jackson's ragged force stood behind it's cotton bales at New Orleans and bested the pride of British regulars. Here are the stories of commanding generals such as America's double-dealing James Wilkinson, Great Britain's gallant Sir Isaac Brock, Canada's heroine farm wife Laura Secord, and country doctor William Beanes, whose capture set the stage for Francis Scott Key to write 'The Star-Spangled Banner.' During the War of 1812, the United States cast off its cloak of colonial adolescence and -- with both humiliating and glorious moments -- found the fire that was to forge a nation.",
      "image": "Covers/1812.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Bright Shining Lie",
      "subtitle": "",
      "author": "Neil Sheehan",
      "published": "1989-09-19T00:00:00.000Z",
      "publisher": "Vintage",
      "pages": 896,
      "description": "In this magisterial book, a monument of history and biography that was awarded the National Book Award and the Pulitzer Prize for Nonfiction, a renowned journalist tells the story of John Vann—'the one irreplaceable American in Vietnam'—and of the tragedy that destroyed a country and squandered so much of America's young manhood and resources.",
      "image": "Covers/A Bright Shining Lie.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Country of Vast Designs",
      "subtitle": "James K. Polk, The Mexican War, and the Conquest of the American Continent",
      "author": "Robert W. Merry",
      "published": "2010-11-02T00:00:00.000Z",
      "publisher": "Simon & Schuster",
      "pages": 608,
      "description": "In a one-term presidency, James K. Polk completed the story of America’s Manifest Destiny—extending its territory across the continent by threatening England with war and manufacturing a controversial and unpopular two-year war with Mexico. \"A crucial architect of modern America, James K. Polk deserves to be elevated out of the mists of history \" (Jon Meacham, author of American Lion).",
      "image": "Covers/A Country of Vast Designs.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Dance With Dragons",
      "subtitle": "",
      "author": "George R.R. Martin",
      "published": "2013-10-29T00:00:00.000Z",
      "publisher": "Bantam",
      "pages": 1152,
      "description": "In the aftermath of a colossal battle, the future of the Seven Kingdoms hangs in the balance—beset by newly emerging threats from every direction. In the east, Daenerys Targaryen, the last scion of House Targaryen, rules with her three dragons as queen of a city built on dust and death. But Daenerys has thousands of enemies, and many have set out to find her. As they gather, one young man embarks upon his own quest for the queen, with an entirely different goal in mind. Fleeing from Westeros with a price on his head, Tyrion Lannister, too, is making his way to Daenerys. But his newest allies in this quest are not the rag-tag band they seem, and at their heart lies one who could undo Daenerys's claim to Westeros forever. Meanwhile, to the north lies the mammoth Wall of ice and stone—a structure only as strong as those guarding it. There, Jon Snow, 998th Lord Commander of the Night's Watch, will face his greatest challenge. For he has powerful foes not only within the Watch but also beyond, in the land of the creatures of ice. From all corners, bitter conflicts reignite, intimate betrayals are perpetrated, and a grand cast of outlaws and priests, soldiers and skinchangers, nobles and slaves, will face seemingly insurmountable obstacles. Some will fail, others will grow in the strength of darkness. But in a time of rising restlessness, the tides of destiny and politics will lead inevitably to the greatest dance of all.",
      "image": "Covers/A Dance with Dragons.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Feast For Crows",
      "subtitle": "",
      "author": "George R.R. Martin",
      "published": "2006-09-26T00:00:00.000Z",
      "publisher": "Bantam",
      "pages": 1104,
      "description": "It seems too good to be true. After centuries of bitter strife and fatal treachery, the seven powers dividing the land have decimated one another into an uneasy truce. Or so it appears. . . . With the death of the monstrous King Joffrey, Cersei is ruling as regent in King’s Landing. Robb Stark’s demise has broken the back of the Northern rebels, and his siblings are scattered throughout the kingdom like seeds on barren soil. Few legitimate claims to the once desperately sought Iron Throne still exist—or they are held in hands too weak or too distant to wield them effectively. The war, which raged out of control for so long, has burned itself out. But as in the aftermath of any climactic struggle, it is not long before the survivors, outlaws, renegades, and carrion eaters start to gather, picking over the bones of the dead and fighting for the spoils of the soon-to-be dead. Now in the Seven Kingdoms, as the human crows assemble over a banquet of ashes, daring new plots and dangerous new alliances are formed, while surprising faces—some familiar, others only just appearing—are seen emerging from an ominous twilight of past struggles and chaos to take up the challenges ahead.",
      "image": "Covers/A Feast For Crows.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Short History Of Europe",
      "subtitle": "- From Pericles to Putin",
      "author": "Simon Jenkins",
      "published": "2019-06-20T00:00:00.000Z",
      "publisher": "VIKIN",
      "pages": 400,
      "description": "The first short, single-volume history of the continent, from the author of the bestselling A Short History of England Europe is an astonishingly successful place. In this dazzling new history, bestselling author Simon Jenkins grippingly tells the story of its evolution from warring peoples to peace, wealth and freedom - a story that twists and turns from Greece and Rome, through the Dark Ages, the Reformation and the French Revolution, to the Second World War and up to the present day. Jenkins takes in leaders from Julius Caesar and Joan of Arc, to Wellington and Angela Merkel, as well as cultural figures from Aristotle to Shakespeare and Picasso. He brings together the transformative forces and dominant eras into one chronological tale - all with his usual insight, colour and authority.",
      "image": "Covers/A Short History of Europe.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "A Storm Of Swords",
      "subtitle": "",
      "author": "George R.R. Martin",
      "published": "2003-03-04T00:00:00.000Z",
      "publisher": "O'Reilly Media",
      "pages": 1216,
      "description": "Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as violently as ever, as alliances are made and broken. Joffrey, of House Lannister, sits on the Iron Throne, the uneasy ruler of the land of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, the victim of the jealous sorceress who holds him in her evil thrall. But young Robb, of House Stark, still rules the North from the fortress of Riverrun. Robb plots against his despised Lannister enemies, even as they hold his sister hostage at King’s Landing, the seat of the Iron Throne. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. . . .",
      "image": "Covers/A Storm of Swords.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "Alexander Hamilton",
      "subtitle": "",
      "author": "Ron Chernow",
      "published": "2005-03-29T00:00:00.000Z",
      "publisher": "Penguin Books",
      "pages": 818,
      "description": "Few figures in American history have been more hotly debated or more grossly misunderstood than Alexander Hamilton. Chernow's biography gives Hamilton his due and sets the record straight, deftly illustrating that the political and economic greatness of today's America is the result of Hamilton's countless sacrifices to champion ideas that were often wildly disputed during his time. “To repudiate his legacy,” Chernow writes, “is, in many ways, to repudiate the modern world.” Chernow here recounts Hamilton's turbulent life: an illegitimate, largely self-taught orphan from the Caribbean, he came out of nowhere to take America by storm, rising to become George Washington's aide-de-camp in the Continental Army, coauthoring The Federalist Papers, founding the Bank of New York, leading the Federalist Party, and becoming the first Treasury Secretary of the United States.Historians have long told the story of America's birth as the triumph of Jefferson's democratic ideals over the aristocratic intentions of Hamilton. Chernow presents an entirely different man, whose legendary ambitions were motivated not merely by self-interest but by passionate patriotism and a stubborn will to build the foundations of American prosperity and power. His is a Hamilton far more human than we've encountered before—from his shame about his birth to his fiery aspirations, from his intimate relationships with childhood friends to his titanic feuds with Jefferson, Madison, Adams, Monroe, and Burr, and from his highly public affair with Maria Reynolds to his loving marriage to his loyal wife Eliza. And never before has there been a more vivid account of Hamilton's famous and mysterious death in a duel with Aaron Burr in July of 1804.",
      "image": "Covers/Alexander Hamilton.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "All The Frequent Troubles Of Our Days",
      "subtitle": "- The True Story Of The American Woman At The Heart Of The German Resistance To Hitler",
      "author": "Rebecca Donner",
      "published": "2021-08-03T00:00:00.000Z",
      "publisher": "Little, Brown and Company",
      "pages": 576,
      "description": "In this “stunning literary achievement,” Donner chronicles the extraordinary life and brutal death of her great-great-aunt Mildred Harnack, the American leader of one of the largest underground resistance groups in Germany during WWII—“a page-turner story of espionage, love and betrayal” (Kai Bird, winner of the Pulitzer Prize for Biography)",
      "image": "Covers/All The Frequent Troubles of Our Days.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "American Heritage History Of The United States",
      "subtitle": "",
      "author": "Douglas Brinkley",
      "published": "1998-11-01T00:00:00.000Z",
      "publisher": "Viking Adult",
      "pages": 640,
      "description": "Douglas Brinkley takes us on the incredible journey of the United States - a nation formed from a vast countryside on whose fringes a few small colonies made a bold cast at freedom, then burgeoned into an expanding democracy, and ultimately flourished as a world power. From the first primitive maps outlining a New World to the faded daguerreotypes of young men in uniforms standing beside Confederate flags; to pictures of hopeful immigrant families arriving at Ellis Island; to the stirring photographs of civil rights marchers; to the terrible images of the Oklahoma City Alfred P. Murrah Federal Building bombing - the history of America offers a stunning album of people and events.",
      "image": "Covers/American Heritage History of the United States.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "American Lion",
      "subtitle": "- Andrew Jackson in the White House",
      "author": "Jon Meacham",
      "published": "2009-04-30T00:00:00.000Z",
      "publisher": "Random House Trade Paperbacks",
      "pages": 512,
      "description": "Andrew Jackson, his intimate circle of friends, and his tumultuous times are at the heart of this remarkable book about the man who rose from nothing to create the modern presidency. Beloved and hated, venerated and reviled, Andrew Jackson was an orphan who fought his way to the pinnacle of power, bending the nation to his will in the cause of democracy. Jackson's election in 1828 ushered in a new and lasting era in which the people, not distant elites, were the guiding force in American politics. Democracy made its stand in the Jackson years, and he gave voice to the hopes and the fears of a restless, changing nation facing challenging times at home and threats abroad. To tell the saga of Jackson's presidency, acclaimed author Jon Meacham goes inside the Jackson White House. Drawing on newly discovered family letters and papers, he details the human drama the family, the women, and the inner circle of advisers that shaped Jackson's private world through years of storm and victory.",
      "image": "Covers/American Lion.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "American Ulysses",
      "subtitle": "- A Life Of Ulysses S. Grant",
      "author": "Ron Chernow",
      "published": "2016-10-04T00:00:00.000Z",
      "publisher": "Random House",
      "pages": 864,
      "description": "In his time, Ulysses S. Grant was routinely grouped with George Washington and Abraham Lincoln in the “Trinity of Great American Leaders.” But the battlefield commander-turned-commander-in-chief fell out of favor in the twentieth century. In American Ulysses, Ronald C. White argues that we need to once more revise our estimates of him in the twenty-first. Based on seven years of research with primary documents—some of them never examined by previous Grant scholars—this is destined to become the Grant biography of our time. White, a biographer exceptionally skilled at writing momentous history from the inside out, shows Grant to be a generous, curious, introspective man and leader—a willing delegator with a natural gift for managing the rampaging egos of his fellow officers. His wife, Julia Dent Grant, long marginalized in the historic record, emerges in her own right as a spirited and influential partner. One of those rare books that successfully recast our impression of an iconic historical figure, American Ulysses gives us a finely honed, three-dimensional portrait of Grant the man—husband, father, leader, writer—that should set the standard by which all future biographies of him will be measured.",
      "image": "Covers/American Ulysses.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "An Army At Dawn",
      "subtitle": "- The War In North Africa, 1942-1943",
      "author": "Rick Atkinson",
      "published": "2002-10-02T00:00:00.000Z",
      "publisher": "Henry Holt and Co.",
      "pages": 681,
      "description": "The liberation of Europe and the destruction of the Third Reich is a story of courage and enduring triumph, of calamity and miscalculation. In this first volume of the Liberation Trilogy, Rick Atkinson shows why no modern reader can understand the ultimate victory of the Allied powers without a grasp of the great drama that unfolded in North Africa in 1942 and 1943. That first year of the Allied war was a pivotal point in American history, the moment when the United States began to act like a great power.Beginning with the daring amphibious invasion in November 1942, An Army at Dawn follows the American and British armies as they fight the French in Morocco and Algeria, and then take on the Germans and Italians in Tunisia. Battle by battle, an inexperienced and sometimes poorly led army gradually becomes a superb fighting force. Central to the tale are the extraordinary but fallible commanders who come to dominate the battlefield: Eisenhower, Patton, Bradley, Montgomery, and Rommel. Brilliantly researched, rich with new material and vivid insights, Atkinson's narrative provides the definitive history of the war in North Africa.",
      "image": "Covers/An Army At Dawn.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "Ancient Rome",
      "subtitle": "- The Rise And Fall Of An Empire",
      "author": "Simon Baker",
      "published": "2007-07-03T00:00:00.000Z",
      "publisher": "BBC Physical Audio",
      "pages": 448,
      "description": "Ancient Rome is the story of the greatest empire the world has ever known. Focusing on six turning points in Roman history, Simon Baker's absorbing narrative charts the rise and fall of a political machine unmatched in its brutality, genius, and lust for power. From the conquest of the Mediterranean in the 3rd century BC to the destruction of the empire at the hands of barbarian invaders 700 years later, we discover the pivotal episodes in Roman history. At the heart of this account are some of the most powerful rulers in history—men like Julius Caesar, Augustus, Nero, and Constantine. Putting flesh on the bones of these legendary figures, Baker looks beyond the dusty caricatures to explore their real motivations, ambitions, intrigues, and rivalries. The superb narrative, full of energy and imagination, is a brilliant distillation of the latest scholarship and a wonderfully evocative account of ancient Rome.",
      "image": "Covers/Ancient Rome.jpg",
      "tags": ""
    },
    {
      "isbn": "",
      "title": "Andrew Jackson",
      "subtitle": "",
      "author": "Sean Wilentz",
      "published": "2005-12-27T00:00:00.000Z",
      "publisher": "Time Books-Henry Holt and Company",
      "pages": 448,
      "description": "The Founding Fathers espoused a republican government, but they were distrustful of the common people, having designed a constitutional system that would temper popular passions. But as the revolutionary generation passed from the scene in the 1820s, a new movement, based on the principle of broader democracy, gathered force and united behind Andrew Jackson, the charismatic general who had defeated the British at New Orleans and who embodied the hopes of ordinary Americans. Raising his voice against the artificial inequalities fostered by birth, station, monied power, and political privilege, Jackson brought American politics into a new age. Sean Wilentz, one of America's leading historians of the nineteenth century, recounts the fiery career of this larger-than-life figure, a man whose high ideals were matched in equal measure by his failures and moral blind spots, a man who is remembered for the accomplishments of his eight years in office and for the bitter enemies he made. It was in Jackson's time that the great conflicts of American politics―urban versus rural, federal versus state, free versus slave―crystallized, and Jackson was not shy about taking a vigorous stand. It was under Jackson that modern American politics began, and his legacy continues to inform our debates to the present day.",
      "image": "Covers/Andrew Jackson.jpg",
      "tags": ""
    }
  ]
}